app/controllers/school_classes_controller.rb

SELECT "school_classes".* FROM "school_classes"
---
    def index
        @schoolclasses = SchoolClass.all

UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "butt kickin 100"], ["updated_at", "2021-02-07 04:15:25.725521"], ["id", 1]]
---
    def update
        @class.update(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_class
        @class = SchoolClass.find(params[:id])