app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Bevis"], ["last_name", "Mcbeevs"], ["updated_at", "2021-02-07 04:51:36.147473"], ["id", 1]]
---
    def update
        find_student
        @student.update(student_params)